balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GC008.PIC
    <edc:Pin>
      <!--Pin 52-->
      <edc:VirtualPin edc:name="RP30"/>
      <edc:VirtualPin edc:name="SEG40"/>
      <edc:VirtualPin edc:name="CN70"/>
      <edc:VirtualPin edc:name="RF2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 53-->
      <edc:VirtualPin edc:name="RP15"/>
      <edc:VirtualPin edc:name="SEG41"/>
      <edc:VirtualPin edc:name="CN74"/>
      <edc:VirtualPin edc:name="RF8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 54-->
      <edc:VirtualPin edc:name="CN83"/>
      <edc:VirtualPin edc:name="RF7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 55-->
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="CN84"/>
      <edc:VirtualPin edc:name="RF6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 56-->
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="SEG47"/>
      <edc:VirtualPin edc:name="CN73"/>
      <edc:VirtualPin edc:name="RG3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 57-->
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="SEG28"/>
      <edc:VirtualPin edc:name="CN72"/>
      <edc:VirtualPin edc:name="RG2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 58-->
      <edc:VirtualPin edc:name="SCL2"/>
      <edc:VirtualPin edc:name="SEG56"/>
      <edc:VirtualPin edc:name="CN35"/>
      <edc:VirtualPin edc:name="RA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 59-->
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="SEG57"/>
      <edc:VirtualPin edc:name="PMA20"/>
      <edc:VirtualPin edc:name="CN36"/>
      <edc:VirtualPin edc:name="RA3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 60-->
      <edc:VirtualPin edc:name="TDI"/>
      <edc:VirtualPin edc:name="PMA21"/>
      <edc:VirtualPin edc:name="CN37"/>
      <edc:VirtualPin edc:name="RA4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 61-->
      <edc:VirtualPin edc:name="TDO"/>
      <edc:VirtualPin edc:name="CN38"/>
      <edc:VirtualPin edc:name="RA5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 62-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 63-->
      <edc:VirtualPin edc:name="OSCI"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="CN23"/>
      <edc:VirtualPin edc:name="RC12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 64-->
      <edc:VirtualPin edc:name="OSCO"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="CN22"/>
      <edc:VirtualPin edc:name="RC15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 65-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 66-->
      <edc:VirtualPin edc:name="RPI36"/>
      <edc:VirtualPin edc:name="SEG42"/>
      <edc:VirtualPin edc:name="OCTRIG2"/>
      <edc:VirtualPin edc:name="PMA22"/>
      <edc:VirtualPin edc:name="CN43"/>
      <edc:VirtualPin edc:name="RA14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 67-->
      <edc:VirtualPin edc:name="RPI35"/>
      <edc:VirtualPin edc:name="SEG43"/>
      <edc:VirtualPin edc:name="PMBE1"/>
      <edc:VirtualPin edc:name="CN44"/>
      <edc:VirtualPin edc:name="RA15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 68-->
      <edc:VirtualPin edc:name="RP2"/>
      <edc:VirtualPin edc:name="SEG13"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="OCTRIG1"/>
      <edc:VirtualPin edc:name="CN53"/>
      <edc:VirtualPin edc:name="RD8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 69-->
      <edc:VirtualPin edc:name="RP4"/>
      <edc:VirtualPin edc:name="SEG14"/>
      <edc:VirtualPin edc:name="PMACK2"/>
      <edc:VirtualPin edc:name="CN54"/>
      <edc:VirtualPin edc:name="RD9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 70-->
      <edc:VirtualPin edc:name="RP3"/>
      <edc:VirtualPin edc:name="SEG15"/>
      <edc:VirtualPin edc:name="C3IND"/>
      <edc:VirtualPin edc:name="PMA15"/>
      <edc:VirtualPin edc:name="CS2"/>
      <edc:VirtualPin edc:name="CN55"/>
      <edc:VirtualPin edc:name="RD10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 71-->
      <edc:VirtualPin edc:name="RP12"/>
      <edc:VirtualPin edc:name="SEG16"/>
      <edc:VirtualPin edc:name="C3INC"/>
      <edc:VirtualPin edc:name="PMA14"/>
      <edc:VirtualPin edc:name="CS1"/>
      <edc:VirtualPin edc:name="CN56"/>
      <edc:VirtualPin edc:name="RD11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 72-->
      <edc:VirtualPin edc:name="RP11"/>
      <edc:VirtualPin edc:name="SEG17"/>
      <edc:VirtualPin edc:name="CN49"/>
      <edc:VirtualPin edc:name="RD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 73-->
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="RC13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 74-->
      <edc:VirtualPin edc:name="RPI37"/>
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="SCLKI"/>
      <edc:VirtualPin edc:name="RC14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 75-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 76-->
      <edc:VirtualPin edc:name="RP24"/>
      <edc:VirtualPin edc:name="SEG20"/>
      <edc:VirtualPin edc:name="CN50"/>
      <edc:VirtualPin edc:name="RD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 77-->
      <edc:VirtualPin edc:name="RP23"/>
      <edc:VirtualPin edc:name="SEG21"/>
      <edc:VirtualPin edc:name="PMACK1"/>
      <edc:VirtualPin edc:name="CN51"/>
      <edc:VirtualPin edc:name="RD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 78-->
      <edc:VirtualPin edc:name="RP22"/>
      <edc:VirtualPin edc:name="SEG22"/>
      <edc:VirtualPin edc:name="PMBE0"/>
      <edc:VirtualPin edc:name="CN52"/>
      <edc:VirtualPin edc:name="RD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 79-->
      <edc:VirtualPin edc:name="RPI42"/>
      <edc:VirtualPin edc:name="SEG44"/>
      <edc:VirtualPin edc:name="PMD12"/>
      <edc:VirtualPin edc:name="CN57"/>
      <edc:VirtualPin edc:name="RD12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 80-->
      <edc:VirtualPin edc:name="SEG45"/>
      <edc:VirtualPin edc:name="PMD13"/>
      <edc:VirtualPin edc:name="CN19"/>
      <edc:VirtualPin edc:name="RD13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 81-->
      <edc:VirtualPin edc:name="RP25"/>
      <edc:VirtualPin edc:name="SEG23"/>
      <edc:VirtualPin edc:name="PMWR"/>
      <edc:VirtualPin edc:name="CN13"/>
      <edc:VirtualPin edc:name="RD4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 82-->
      <edc:VirtualPin edc:name="RP20"/>
      <edc:VirtualPin edc:name="SEG24"/>
      <edc:VirtualPin edc:name="PMRD"/>
      <edc:VirtualPin edc:name="CN14"/>
      <edc:VirtualPin edc:name="RD5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 83-->
      <edc:VirtualPin edc:name="C3INB"/>
      <edc:VirtualPin edc:name="SEG25"/>
      <edc:VirtualPin edc:name="PMD14"/>
      <edc:VirtualPin edc:name="CN15"/>
      <edc:VirtualPin edc:name="RD6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 84-->
      <edc:VirtualPin edc:name="C3INA"/>
      <edc:VirtualPin edc:name="SEG26"/>
      <edc:VirtualPin edc:name="PMD15"/>
      <edc:VirtualPin edc:name="CN16"/>
      <edc:VirtualPin edc:name="RD7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 85-->
      <edc:VirtualPin edc:name="VCAP"/>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 86-->
      <edc:VirtualPin edc:name="VBAT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 87-->
      <edc:VirtualPin edc:name="SEG27"/>
      <edc:VirtualPin edc:name="PMD11"/>
      <edc:VirtualPin edc:name="CN68"/>
      <edc:VirtualPin edc:name="RF0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 88-->
      <edc:VirtualPin edc:name="COM4"/>
      <edc:VirtualPin edc:name="SEG48"/>
      <edc:VirtualPin edc:name="PMD10"/>
      <edc:VirtualPin edc:name="CN69"/>
      <edc:VirtualPin edc:name="RF1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 89-->
      <edc:VirtualPin edc:name="SEG46"/>
      <edc:VirtualPin edc:name="PMD9"/>
      <edc:VirtualPin edc:name="CN78"/>
      <edc:VirtualPin edc:name="RG1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 90-->
      <edc:VirtualPin edc:name="SEG50"/>
      <edc:VirtualPin edc:name="PMD8"/>
      <edc:VirtualPin edc:name="CN77"/>
      <edc:VirtualPin edc:name="RG0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 91-->
      <edc:VirtualPin edc:name="AN23"/>
      <edc:VirtualPin edc:name="SEG58"/>
      <edc:VirtualPin edc:name="CN39"/>
      <edc:VirtualPin edc:name="RA6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 92-->
      <edc:VirtualPin edc:name="AN22"/>
      <edc:VirtualPin edc:name="SEG59"/>
      <edc:VirtualPin edc:name="PMA17"/>
      <edc:VirtualPin edc:name="CN40"/>
      <edc:VirtualPin edc:name="RA7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 93-->
      <edc:VirtualPin edc:name="COM3"/>
      <edc:VirtualPin edc:name="PMD0"/>
      <edc:VirtualPin edc:name="CN58"/>
      <edc:VirtualPin edc:name="RE0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 94-->
      <edc:VirtualPin edc:name="COM2"/>
      <edc:VirtualPin edc:name="PMD1"/>
      <edc:VirtualPin edc:name="CN59"/>
      <edc:VirtualPin edc:name="RE1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 95-->
      <edc:VirtualPin edc:name="SEG60"/>
      <edc:VirtualPin edc:name="PMA16"/>
      <edc:VirtualPin edc:name="CTED11"/>
      <edc:VirtualPin edc:name="CN81"/>
      <edc:VirtualPin edc:name="RG14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 96-->
      <edc:VirtualPin edc:name="SEG61"/>
      <edc:VirtualPin edc:name="CN79"/>
      <edc:VirtualPin edc:name="RG12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 97-->
      <edc:VirtualPin edc:name="SEG62"/>
      <edc:VirtualPin edc:name="CTED10"/>
      <edc:VirtualPin edc:name="CN80"/>
      <edc:VirtualPin edc:name="RG13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 98-->
      <edc:VirtualPin edc:name="COM1"/>
      <edc:VirtualPin edc:name="PMD2"/>
      <edc:VirtualPin edc:name="CN60"/>
      <edc:VirtualPin edc:name="RE2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 99-->
      <edc:VirtualPin edc:name="COM0"/>
      <edc:VirtualPin edc:name="PMD3"/>
      <edc:VirtualPin edc:name="CTED9"/>
      <edc:VirtualPin edc:name="CN61"/>
      <edc:VirtualPin edc:name="RE3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 100-->
      <edc:VirtualPin edc:name="SEG63"/>
      <edc:VirtualPin edc:name="PMD4"/>
      <edc:VirtualPin edc:name="LVDIN"/>
      <edc:VirtualPin edc:name="CTED8"/>
      <edc:VirtualPin edc:name="CN62"/>
      <edc:VirtualPin edc:name="RE4"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>